/* ORC - TRAP nickname in message body                               */
/* /alias <password> trap:----001 pascoetrap.rexx pascoe             */
options results
parse arg orcport a1

address command 'sound sounds:samples/lemming.letsgo q'
