/*
** EditUser.rexx -- Called by Voyeur to edit user
*/

Options Results
Parse Arg Line

address command 'Zeus:Utils/UserEditor LINE 'Line' ACCOUNT'
exit
